# -*- coding: utf-8 -*-
import sys
sys.stdout.reconfigure(encoding='utf-8')
"""
============================================================
  第2课 练习 —— 数据类型
  在这里写你的答案！
============================================================
"""

print("=" * 50)
print("  第2课练习：数据类型")
print("=" * 50)

# ==========================================
# 练习1：计算圆的面积
# 提示：面积 = 3.14 * r ** 2，假设半径 r = 5
# ==========================================

# 在这里写你的代码：
pi= 3.14
r = 5
area = pi * r **2
print(f"半径为{r}的圆的面积是{area}")




# ==========================================
# 练习2：把字符串按逗号分割
# 字符串: "apple,banana,grape"
# ==========================================

# 在这里写你的代码：
fruits = "apple,banana,grape"
fruit_list = fruits.split(",")
print(fruit_list)



# ==========================================
# 练习3：检查 100 是奇数还是偶数
# 提示：用 % 取余运算
# ==========================================

# 在这里写你的代码：
num = 100
if num%2 == 0:
    print("100是偶数")
else:
    print("100是奇数")



# ==========================================
# 练习4：把你的名字反转输出
# 提示：用切片 [::-1]
# ==========================================

# 在这里写你的代码：
name = "Kerlaier"
resverse_name = name[::-1]
print(f"反转后是：{resverse_name}")



# ==========================================
# 练习5：判断 2024 是否是闰年
# 提示：能被4整除但不能被100整除，或者能被400整除
# ==========================================

# 在这里写你的代码：
year = 2024
if(year % 4 == 0 and year % 100 !=0) or (year % 400 ==0):
    print("是闰年")
else:
    print("不是闰年")